app/controllers/clients_controller.rb

  def index
    authorize(:employee)
    @clients = current_company.clients.all
---
SELECT `clients`.* FROM `clients`  WHERE `clients`.`company_id` = 1

  def create
    authorize(:employee)
    @client = current_company.clients.new(client_params)
    @client.save!
---
INSERT INTO `clients` (`billing_address`, `code`, `company_id`, `created_at`, `email`, `end_date`, `name`, `start_date`, `updated_at`) VALUES ('asdasdasd', 'xx234', 1, '2016-11-08 08:17:54', 'galum@domain', '2017-11-06', 'galum', '2016-11-07', '2016-11-08 08:17:54')