app/controllers/companies_controller.rb

  def create
    @company = Company.new(company_params)
    @company.user = current_user
    @company.save!
---
INSERT INTO `companies` (`created_at`, `name`, `updated_at`, `user_id`) VALUES ('2016-11-08 08:16:22', 'galumbang', '2016-11-08 08:16:22', 1)