app/controllers/documents_controller.rb

SELECT  `invoices`.* FROM `invoices`  WHERE `invoices`.`company_id` = 1 AND `invoices`.`id` = 1 LIMIT 1
---
  def create
    @invoice = current_company.invoices.find(params[:invoice_id])