app/controllers/feedbacks_controller.rb

SELECT  `clients`.* FROM `clients`  WHERE `clients`.`id` = 1 LIMIT 1
INSERT INTO `feedbacks` (`client_id`, `client_name`, `created_at`, `gid`, `updated_at`) VALUES (1, 'galum', '2016-11-21 07:12:20', '1wVjQ', '2016-11-21 07:12:20')
---
  def create
    client = Client.find(params[:client_id])
    feedback = Feedback.new(client_id: client.id)
    feedback.gid = feedback.generate_gid
    feedback.save