app/controllers/invoices_controller.rb

  def index
    authorize(:invoice)
    @clients = Client.find(params[:client_id])
---
SELECT  `clients`.* FROM `clients`  WHERE `clients`.`id` = 1 LIMIT 1

  def new
    authorize(:invoice)
    @client = Client.find(params[:client_id])
---
SELECT  `clients`.* FROM `clients`  WHERE `clients`.`id` = 1 LIMIT 1

  def create
    authorize(:invoice)
    @invoice = current_company.invoices.new(invoice_params)
    InvoiceProcessor.instance.process(@invoice)
    if @invoice.save
---
INSERT INTO `invoices` (`begin_date`, `client_id`, `company_id`, `created_at`, `end_date`, `number`, `payment_information`, `subtotal`, `tax_amount`, `tax_percent`, `total`, `updated_at`) VALUES ('2012-12-12', 1, 1, '2016-11-21 06:51:17', '2013-01-12', 'xx2340001', 'info', 0.0, 0.0, 0.0, 0.0, '2016-11-21 06:51:17')