app/controllers/timesheet_reports_controller.rb

SELECT `employees`.* FROM `employees`
SELECT `projects`.* FROM `projects`
---
  def index
    @employee = Employee.all
    @project = Project.all